Repository: neverewer/Stepel_flutter
Catalog: stepel_flutter/lib/core/localization/*.arb
Languages: ru

# welcomePageStartButtonText
source: Start
ru: Начать

# welcomePageParagraph1Title
source: Watch your health
ru: Следите за здоровьем

# welcomePageParagraph1Description
source: Make it easy to count your steps twenty-four-seven because every step is worth and let's keep track your healt.
ru: Упростите подсчет шагов двадцать четыре часа в сутки, потому что каждый шаг имеет ценность, и давайте следить за вашим здоровьем.

# welcomePageParagraph2Title
source: Walk together
ru: Гуляйте вместе

# welcomePageParagraph2Description
source: Compete with your friends to see who can complete the most steps.
ru: Соревнуйтесь с друзьями, чтобы узнать, кто пройдет больше шагов.

# welcomePageParagraph3Title
source: Your goals
ru: Ваши цели

# welcomePageParagraph3Description
source: Set goals for your daily number of steps and always achieve them.
ru: Ставьте цели по ежедневному количеству шагов и всегда достигайте их.

# authPageText
source: Is your goal a healthy and active lifestyle? Were on the same page!
ru: Ваша цель - здоровый и активный образ жизни? Нам по пути!

# permissonsPageTitle
source: Track my activity
ru: Отслеживать мою активность

# permissonsPageSubTitle
source: Stepel can track walking metrics in the background. This means that you will receive information about the number of steps, distance traveled and calories burned for this type of activity. Stepel can track walking metrics in the background. This means that you will receive information about the number of steps, distance traveled and calories burned for this type of activity. If you don't want to grant permission, the app won't be able to track your activity and will be useless.
ru: Stepel может отслеживать в фоновом режиме показатели ходьбы. Это означает, что вы будете получать информацию о числе шагов, пройденном расстоянии и расходе калорий для данного вида активности. Stepel может отслеживать в фоновом режиме показатели ходьбы. Это означает, что вы будете получать информацию о числе шагов, пройденном расстоянии и расходе калорий для данного вида активности. Если вы не хотите давать разрешение, приложение не сможет отслеживать вашу активность и будет бесполезным.

# permissionsPageRejectButtonText
source: No thanks
ru: Нет, спасибо

# permissionsPageConfirmButtonText
source: Enable
ru: Включить

# mainPageHomePageButtonText
source: Home
ru: Главная

# mainPageJournalPageButtonText
source: Journal
ru: Журнал

# mainPageProfilePageButtonText
source: Profile
ru: Профиль

# cardioPointsLabelText
source: Heart Pts
ru: Кардио-баллы

# stepsLabelText
source: Steps
ru: Шаги

# caloriesStatisticBoxText
source: Ccal
ru: Ккал

# distanceStatisticBoxText
source: Km
ru: Км

# movingTimeStatisticBoxText
source: Move min
ru: Мин

# homePageTrendsLabel
source: TRENDS
ru: ТЕНДЕНЦИИ

# homePageRecomendationsLabel
source: RECOMENDATIONS
ru: РЕКОМЕНДАЦИИ

# homePageCardioPointsTrendLabel
source: Heart Points
ru: Баллы кардиотренировок

# homePageStepsTrendLabel
source: Steps
ru: Шаги

# homePageCaloriesTrendLabel
source: Calories
ru: Расход энергии

# homePageTrendsSubTitle
source: For last 7 days
ru: За последние 7 дней

# homePageTrendsStatisticBoxText
source: Today
ru: Сегодня

# journalPageTitle
source: Journal
ru: Журнал

# profilePageTitle
source: Profile
ru: Профиль

# profilePageActivityGoalsSectionText
source: Activity goals
ru: Фитнес-цели

# profilePageBedtimeScheduleSectionText
source: Bedtime schedule
ru: Расписание режима сна

# profilePageAboutYouSectionText
source: About you
ru: Ваши данные

# pickerCancelButtonText
source: Cancel
ru: Отмена

# profilePageStepsTargetInfoBoxLabel
source: Steps
ru: Шаги

# profilePageCardioPointsTargetInfoBoxLabel
source: Cardio-points
ru: Баллы кардиотренировок

# profilePageGetInBedInfoBoxLabel
source: Get in bed
ru: Отход ко сну

# profilePageWakeUpInfoBoxLabel
source: Wake up
ru: Пробуждение

# profilePageGenderInfoBoxLabel
source: Gender
ru: Пол

# profilePageBirthdayInfoBoxLabel
source: Birthday
ru: День рождения

# profilePageWeightInfoBoxLabel
source: Weight
ru: Вес

# profilePageHeightInfoBoxLabel
source: Height
ru: Рост

# profilePageTimePickerLabel
source: SELECT TIME
ru: ВЫБОР ВРЕМЕНИ

# profilePageTimePickerHourLabelText
source: Hour
ru: Час

# profilePageTimePickerMinuteLabelText
source: Minute
ru: Минуты

# infoDialogDoneButtonText
source: Done
ru: ОК

# infoDialogNextButtonText
source: Next
ru: Далее

# infoDialogCard1Title
source: Track your workload with Stepel
ru: Отслеживайте свою нагрузку со Stepel

# infoDialogCard1CardioPointsLabel
source: Heart Points
ru: Баллы кардиотренировок

# infoDialogCard1CardioPointsDescription
source: Move more to earn points
ru: Чтобы заработать баллы, больше двигайтесь

# infoDialogCard1StepsLabel
source: Steps
ru: Шаги

# infoDialogCard1StepsDescription
source: Just keep moving to meet this goal
ru: Чтобы достичь цели, находитесь в движении

# infoDialogCard1Description
source: The Stepel app not only counts steps, but also earns heart points
ru: В приложении Stepel не только подсчитываются шаги, но и начисляются баллы кардиотренировок

# infoDialogCard2Title
source: How to score your Heart Points
ru: Как зарабатывать баллы кардиотренировок

# infoDialogCard2Description
source: Score points for activity that raises your heart rate, like walking or cycling
ru: Получайте баллы кардиотренировок за любую активность, например ходьбу или езду на велосипеде.
